cf/InformationRegisters/ПодпискиНаОповещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПодпискиНаОповещение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Способы</Name>
					<Comment>Длинная строка формата 00100100 где 1 означают номер включенного способа (порядок определяется по коду справочника)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подписчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.События</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/CommonModules/СобытияКлиент/Ext/Module.bsl
Функция ИмяПоказаноОповещение() Экспорт Возврат "Показано оповещение" КонецФункции

Процедура Иницилизировать() Экспорт
	
	ПодключитьОбработчикОжидания("ПросканироватьНовыеСообщения", 4, Ложь);	// Запустим сканирование новых сообщений
	
КонецПроцедуры
Процедура ПросканироватьПоявлениеНовыхСообщений() Экспорт
	
	~ПроверкаСообщений:
	КолСообщений = События.ПолучитьКоличествоТекущихСообщений();
		
	Если КолСообщений Тогда
		
		Сообщение = События.ПолучитьСообщение();
		Если Сообщение <> Неопределено Тогда
			
			// Покажем
			ПоказатьОповещениеПользователя(Сообщение.Название, ?(Сообщение.Свойство("Инициатор") И ЗначениеЗаполнено(Сообщение.Инициатор), ПолучитьНавигационнуюСсылку(Сообщение.Инициатор), Неопределено), Сообщение.КраткоеОписание, БиблиотекаКартинок.СистемаОповещений);
				
			// Удалим
			События.УдалитьСообщение(Сообщение.guid); 
			
			// Оповестим
			Оповестить(ИмяПоказаноОповещение()); КонецЕсли; КонецЕсли;
	
КонецПроцедуры

Функция ОткрытьФормуПодписки(Событие, Ссылка, Пользователь = Неопределено, Владелец = Неопределено) Экспорт
	
	ПочемутоМассив = Новый Массив;
    ПочемутоМассив.Добавить(Новый Структура("Подписчик, Событие, Ссылка", ?(Пользователь = Неопределено, глТекущийПользователь, Пользователь), Событие, Ссылка));
	
	Ключ = Новый("РегистрСведенийКлючЗаписи.ПодпискиНаОповещение", ПочемутоМассив);
	
	ОткрытьФорму("РегистрСведений.ПодпискиНаОповещение.ФормаЗаписи", Новый Структура("Ключ", Ключ), Владелец, , , , ?(Владелец = Неопределено, Неопределено, Новый ОписаниеОповещения("ТекстПодпискиЗакрытиеФормы", Владелец)));
	
КонецФункции
Функция ПолучитьКлючЗаписиПодписки(Событие, Ссылка, Пользователь = Неопределено) Экспорт
	
	ПочемутоМассив = Новый Массив;
    ПочемутоМассив.Добавить(Новый Структура("Подписчик, Событие, Ссылка", ?(Пользователь = Неопределено, глТекущийПользователь, Пользователь), Событие, Ссылка));
	
	Возврат Новый("РегистрСведенийКлючЗаписи.ПодпискиНаОповещение", ПочемутоМассив);
	
КонецФункции

Процедура ВыбраноОповещение(ВыбЭлемент, ДопПараметры) Экспорт
	
	Если ВыбЭлемент <> Неопределено И События.ОбработкаВыбораОповещенияНаОбъекте(ВыбЭлемент.Значение, ДопПараметры.Ссылка) Тогда
		
		ПоказатьОповещениеПользователя("Оповещение установлено",,ВыбЭлемент.Представление, БиблиотекаКартинок.СистемаОповещений);
		
		//ОбновитьТекстОповещений();
		ДопПараметры.Форма.ОбновитьТекстОповещений();
		
		Оповестить("ОбновитьНастройкиОповещения");
		
	КонецЕсли;
	
КонецПроцедуры
Процедура УправлениеПодпискойСФормыОбъектаНажатие(Форма, Элемент, ВидОбъекта, Ссылка) Экспорт
	
	Форма.ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ВыбраноОповещение", СобытияКлиент, Новый Структура("Форма, Ссылка", Форма, Ссылка)), События.ПолучитьСписокСобытийДляОбъекта(ВидОбъекта), Элемент);
	
КонецПроцедуры
Процедура ВыбранаНастройка(ВыбЭлемент, ДопПараметры) Экспорт
	
	Если ВыбЭлемент <> Неопределено Тогда
		ОткрытьФормуПодписки(ВыбЭлемент.Значение.Событие, ВыбЭлемент.Значение.Ссылка,,ДопПараметры.Форма); КонецЕсли;

КонецПроцедуры
Процедура ТекстПодпискиФормыОбъектаНажатие(Форма, Элемент, Ссылка) Экспорт
	
	Записи = События.ПолучитьЗаписиСобытийСсылки(Ссылка);
	
	Если Записи.Количество() = 1 Тогда
		
		ОткрытьФормуПодписки(Записи[0].Событие, Ссылка,,Форма);
		
	ИначеЕсли Записи.Количество() > 1 Тогда
		
		Список = Новый СписокЗначений;
		Для Каждого Запись Из Записи Цикл
			Список.Добавить(Запись, События.ПолучитьОписаниеПодписки(Запись,,,Ложь)) КонецЦикла;
		
		Форма.ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ВыбранаНастройка", СобытияКлиент, Новый Структура("Форма", Форма)), Список, Элемент); КонецЕсли;
	
КонецПроцедуры
